---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntry
source: html/119355ca-f9b6-3d6a-b315-6977ac95edbe.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntry

A key-based tree entry, containing the key, parent key, and children keys (if applicable).

## Syntax (C#)
```csharp
public class KeyBasedTreeEntry : IDisposable
```